 const data = [
    {
        id: 1,
        name: "ayat 1",
        details: "আরব মানেই আমরা বুঝি দিনে প্রখর রোদ, রাতে হাড়কাঁপানো শীত, বালু দ্বারা ভরপুর ও শষ্যবিহীন বিশিষ্ট কোন এক অঞ্চল। আরবের পশ্চিমে লোহিত সাগর ও সিনাই উপদ্বীপ। পূর্বে আরব উপসাগর ও দক্ষিণ ইরাকের অংশ। দক্ষিণে আরব সাগর। উত্তরে শামরাজ্য। আরব অঞ্চল হলো দুর্গম একটি অঞ্চল। পৃথিবীর অনান্য রাজ্য বা অঞ্চলগুলো বিজয়ের জন্য যখন সুপার-পাওয়ারওয়ালারা মারামারি করতে ব্যস্ত তখন আরবরা জীবন কাটাচ্ছিল নিশ্চিন্তে। বহিঃশত্রু দ্বারা আক্রমণের শিকার হবে তা নিয়ে তাদের কোন চিন্তা ছিল না বা ভয় ছিল না। তারা জানতো যে পরাশক্তিগুলো এখানে এসে মরুতে মরার মতন সাহস করবে না। তবে জাহাজের যাতায়াতের ব্যবস্থা ছিল এই অঞ্চলের উপকূলের দিকে। যেখানে পৃথিবীর দূর দূর থেকে জাহাজ এসে বন্দরে ভিড়তো এবং এখান থেকেই মালামাল সমগ্র আরবে সাপ্লাই হতো।এবার চলুন একটু জেনে নেই আরব সম্প্রদায় কারা কারা। ইতিহাসবিদরা অক্লান্ত পরিশ্রম করে গবেষণা চালিয়ে ৩টি সম্প্রদায়ের কথা বের করেছেন। তারা বলেন আরব সম্প্রাদায় হলো ৩ প্রকার: ১) আরবে বায়িদাহ: তারা হলো প্রাচীন আরব। তারা বর্তমানে বিলুপ্ত। ২) আরবে আবিরা: তারা হলো ক্বাহত্বানের বংশদ্ভূত। ইতিহাসের পাতায় তারা 'ক্বাহত্বানী' নামে পরিচিত।",
        price: 550
    },
    {
        id: 2,
        name: "ayat 1",
        details: "l;sdkjf;lsakdjfsdkl;fsdf",
        tag: ' quran'
    },
    {
        id: 2,
        name: "ayat 1",
        details: "l;sdkjf;lsakdjfsdkl;fsdf",
        tag: ' quran'
    },
    {
        id: 1,
        name: "ayat 1",
        details: "l;sdkjf;lsakdjfsdkl;fsdf",
        tag: ' quran'
    },
    {
        id: 1,
        name: "ayat 1",
        details: "l;sdkjf;lsakdjfsdkl;fsdf",
        tag: ' quran'
    },
    {
        id: 1,
        name: "ayat 1",
        details: "l;sdkjf;lsakdjfsdkl;fsdf",
        tag: ' quran'
    },
];
export default data;