import React, { useState } from 'react'
import Navbar from '../Navbar/Navbar'
import DetailsSecond from './DetailsSecond'

const CouresDetails = () => {
    const [flipPage, setFlipPage] = useState(false)
    return (
        <div>
            <Navbar />
            <br/>
            <h3>ইসলাম পূর্ব আরব</h3>
            <p class="lead" ><p> আরব মানেই আমরা বুঝি দিনে প্রখর রোদ, রাতে হাড়কাঁপানো শীত, বালু দ্বারা ভরপুর ও শষ্যবিহীন বিশিষ্ট কোন এক অঞ্চল।
আরবের পশ্চিমে লোহিত সাগর ও সিনাই উপদ্বীপ। পূর্বে আরব উপসাগর ও দক্ষিণ ইরাকের অংশ। দক্ষিণে আরব সাগর। উত্তরে শামরাজ্য।
আরব অঞ্চল হলো দুর্গম একটি অঞ্চল। পৃথিবীর অনান্য রাজ্য বা অঞ্চলগুলো বিজয়ের জন্য যখন সুপার-পাওয়ারওয়ালারা মারামারি করতে ব্যস্ত তখন আরবরা জীবন কাটাচ্ছিল নিশ্চিন্তে। বহিঃশত্রু দ্বারা আক্রমণের শিকার হবে তা নিয়ে তাদের কোন চিন্তা ছিল না বা ভয় ছিল না। তারা জানতো যে পরাশক্তিগুলো এখানে এসে মরুতে মরার মতন সাহস করবে না। তবে জাহাজের যাতায়াতের ব্যবস্থা ছিল এই অঞ্চলের উপকূলের দিকে। যেখানে পৃথিবীর দূর দূর থেকে জাহাজ এসে বন্দরে ভিড়তো এবং এখান থেকেই মালামাল সমগ্র আরবে সাপ্লাই হতো।
এবার চলুন একটু জেনে নেই আরব সম্প্রদায় কারা কারা। ইতিহাসবিদরা অক্লান্ত পরিশ্রম করে গবেষণা চালিয়ে ৩টি সম্প্রদায়ের কথা বের করেছেন। তারা বলেন আরব সম্প্রাদায় হলো ৩ প্রকার:</p><p> 
১) আরবে বায়িদাহ: তারা হলো প্রাচীন আরব। তারা বর্তমানে বিলুপ্ত। 
২) আরবে আবিরা: তারা হলো ক্বাহত্বানের বংশদ্ভূত। ইতিহাসের পাতায় তারা 'ক্বাহত্বানী' নামে পরিচিত। 
৩) আরবে মুস্তা'রিবা: তারা হলো ইসমাঈল আলাইহিসসালামের বংশধর। ইতিহাসের পাতায় তারা 'আদনানী' নামে পরিচিত।
১ম ক্যাটাগরির আরবরা হলো আদ জাতি, সামুদ জাতি ইত্যাদি। তাদেরকে আল্লাহ আজাব দিয়ে ধ্বংস করে দিয়েছিলেন। কিছু সংখ্যক বেঁচে থাকলেও কালের পরিবর্তে তারা বিলুপ্ত হয়ে গিয়েছে।
২য় ক্যাটাগরির আরবরা হলো 'ইয়েমেনের বাসিন্দা'। তারা ক্বাহত্বানী নামে প্রসিদ্ধ। তারা প্রাচীন কাল থেকে ইয়েমে বসবাস করে আসছে। তাদের উপর আল্লাহর আশীর্বাদ ছিল কিন্তু তারা আল্লাহর দেয়া নিয়ামত ভুলে গিয়েছিল বিধায় আল্লাহ তাদের উপর আযাব দেন।</p><p>

এদিকে ইবরাহীম আলাইহিসসালাম তার স্ত্রী হাজেরা আলাইহাসসালাম ও প্রিয় পুত্র ইসমাঈল আলাইহিসসালামকে মক্কা উপত্যকায় উপনীত হলেন। আশেপাশে নেই কোন শস্য, নেই কোন ফলফলাদি। এমন জায়গায় তাদেরকে রেখে অশ্রুসিক্ত অবস্থায় ইব্রাহীম আলাইহিসসালাম চলে গেলেন ফিলিস্তিনে। তবে তিনি তাদেরকে কিছু খাবার দিয়ে তারপর রওয়ানা হয়েছিলেন। একা একা তারা কিছুদিন এখানেই থেকে গেলেন। কিছুদিন অতিবাহিত হওয়ার পর খাবার ফুরিয়ে গেলো। এই ভয়াবহ সংকট থেকে আল্লাহ তাদেরকে উদ্ধার করলেন 'যমযম' ধারা দান করে। কেটে গেল তাদের সংকট। এখানেই ছেলেকে নিয়ে জীবন কাটাতে লাগলেন হাজেরা আলাইহিসসালাম।

এদিকে ২য় ক্যাটাগরি আরবদের অঞ্চলে আল্লাহর আযাব আসায় প্রায় এলাকা ধ্বংস হয়ে গেল। তারা সেখান থেকে যার যার পরিবার-পরিজন নিয়ে বেরিয়ে পড়লো। এলাকা থেকে দূরে চলে গেল নতুন করে জীবন-যাপন করার জন্য। এদের মধ্য থেকে একটি গোত্র মক্কাভূমিতে আগমন করলো। তারা সেখানে হাজেরা আলাইহাসসালাম ও ইসমাঈলকে দেখতে পেল। তারা হাজেরা আলাইহিসসালামের অনুমতি নিয়ে সেখানে বসবাস করা শুরু করলো। ইতিহাসে এ গোত্রকে 'জুরহুম সানী' নামে বলা হয়ে থাকে।

ইসমাঈল আলাইহিসসালাম তাদের মধ্যেই বড় হতে থাকেন। তিনি যখন যৌবনে পদার্পণ করেন তখন ঐ গোত্র তথা জুরহুম গোত্র থেকে আরবি ভাষা ভালোভাবে আয়ত্ত করেন। পরবর্তীতে তিনি সেই গোত্রের একটি সম্ভ্রান্ত পরিবারের মেয়েকে বিয়ে করেন।

এদিকে ইব্রাহীম আলাইহিসসালাম তাদের নিয়ে চিন্তায় থাকতেন। তিনি মক্কায় যাতায়াত করতেন। একবার ছেলের বাড়িতে এসে তাকে পেলেন না। ছেলের বউয়ের সাথে আলাপ-আলোচনা করলেন কিন্তু তিনি বুঝলেন এই বউ তার ছেলের উপযুক্ত না তাই যাওয়ার সময় ছেলের স্ত্রীকে বললেন, সে আসার পর যেন তাকে বলা হয় বাড়িত দরজা বদলানোর জন্য। ইসমাঈল আলাইহিসসালাম ফিরে আসার পর ঘটনা জানলেন এবং তার স্ত্রীকে তালাক দিলেন।

আবারও তিনি বিয়ে করে সংসার করতে থাকেন। এবারও ইব্রাহীম আলাইহিসসালাম মক্কায় এসে তাকে পেলেন না। ছেলের স্ত্রীর সাথে আলাপ-আলোচনা করলেন। এবার বুঝেন এই মেয়ে তার ছেলের স্ত্রী হিসেবে উপযুক্ত। তিনি এবার বাড়িতে তার ছেলের বউকে বলে গেলেন, সে আসার পর যেন বলে দেন বাড়িত দরজা না বদলাতে। বাড়ি ফিরে ঘটনা শুনে বুঝলেন এই স্ত্রী তার জন্য পার্ফেক্ট।

আবারও পরিবারের কথা মনে পড়লে ইব্রাহীম আলাইহিসসালাম চলে আসেন মক্কায়। এবার ছেলের সাথে ভালো একটা সময় কাটান এবং আল্লাহর নির্দেশে পিতা ও পুত্র মিলে ক্বাবা ঘর তৈরি করেন।

এদিকে ইসমাঈল আলাইহিসসালামের ঘরে অনেক সন্তান জন্ম নিতে থাকে। এরাই হচ্ছে ৩য় ক্যাটাগরির মানুষজন। ইসমাঈল আলাইহিসসালাম ইন্তেকাল করে আল্লাহর কাছে চলে গেলেও রেখে যান তার সন্তানাদি।</p><p>

সন্তানাদি সবাই বড় হয়ে যার যার যার মতন সংসার করতে থাকে। ছোট পরিসর থেকে সেটা কয়েকশ বছরে অনেক বড় হতে থাকে। তারা সিরিয়া, শাম, ইয়েমেনে, পারস্যে ব্যবসায়-বাণিজ্য করে জীবিকা নির্বাহ করতে থাকে। এভাবেই তারা কাটাতে থাকে তাদের জীবন। 
তারা কেবল মক্কায় রয়ে যায়নি বরং আরবের বিভিন্ন ভূখণ্ডে তারা ছড়িয়ে পড়েছিল। সেখানে তারা বসত-ভিটা স্থাপনা করে নতুন করে বসবাস করতে থাকে এবং প্রজন্মের পর প্রজন্ম তাদের সংখ্যা বাড়তে থাকে 
কিন্তু একটা সময়ে আদনানীদের জনসংখ্যা কমে যেতে শুরু করে। ইসমাঈল আলাইহিসসালামের সন্তানেরা মক্কায় বিখ্যাত থাকলেও কালের আবর্তনে কিছু কিছু সন্তানেরা অজ্ঞাত হয়ে পড়ে। তবে রয়ে যায় কয়েকটি গোত্র।

কিছু অজ্ঞাত হয়ে গেলে কী আর এমন হবে, বংশধারা ঠিকই চলছিল। সেই বংশধারা কয়েকশ বছর পার করে একটা সময়ে "কিনানাহ বিন খুযাইমাহ" নামক সন্তানে গিয়ে পৌঁছায়। তখন কিন্তু তারা গোত্র বেইজড জীবন-যাপন করছিল। সেই ব্যক্তির নামানুসারে গোত্রের নাম ছিল "কিনানাহ গোত্র।" 
সেই "কিনানাহ বিন খুযাইমাহ"র সন্তানদের মধ্য থেকে পরবর্তীতে আসেন "ফিহর বিন মালিক বিন নাযার বিন কিনানাহ।" তার গোত্রই হলো "কুরাইশ গোত্র।" মানে "কিনানাহ গোত্র" থেকে পরে একটা সাব/উপ-গোত্র আসে যার নাম "কুরাইশ।" মক্কার আশেপাশে তারা নিজেদের গোত্রের সাথে বসবাস করতে থাকে।

'ইসলামপূর্ব আরব'
</p></p>

            {
                flipPage && <DetailsSecond />
            }
            
            <nav>
                <ul class="pagination vh-100">
                    <li class="page-item"><a class="page-link" href="#" onClick={()=>setFlipPage(false)}>Previous</a></li>
                    <li class="page-item"><a class="page-link" href="#">1</a></li>
                    <li class="page-item"><a class="page-link" href="#">2</a></li>
                    <li class="page-item"><a class="page-link" href="#">3</a></li>
                    <li class="page-item"><a class="page-link" onClick={()=>setFlipPage(true)}>Next</a></li>
                </ul>
            </nav>
        </div>
    )
}

export default CouresDetails
